---
kind: method
id: M:Autodesk.Revit.DB.TriangulationInterface.Dispose
source: html/acc86bb2-6579-c6f9-745f-e0a522b63bca.htm
---
# Autodesk.Revit.DB.TriangulationInterface.Dispose Method

Releases all resources used by the TriangulationInterface

## Syntax (C#)
```csharp
public void Dispose()
```